cmsis-svd/cmsis-svd/data/Freescale/MKW20Z4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RSIM</name>
      <description>Radio System Integration Module</description>
      <prependToName>RSIM_</prependToName>
      <baseAddress>0x40059000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BTLL_RSIM</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>RSIM Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_RF_OSC_REQ_EN</name>
              <description>BLE Ref Osc (Sysclk) Request Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_RF_OSC_REQ_STAT</name>
              <description>BLE Ref Osc (Sysclk) Request Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLE_RF_OSC_REQ_INT_EN</name>
              <description>BLE Ref Osc (Sysclk) Request Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_RF_OSC_REQ_INT</name>
              <description>BLE Ref Osc (Sysclk) Request Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_EN</name>
              <description>RF Ref Osc Enable [3:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>RF Ref Osc will be controlled by the SoC or the BLE link layer</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>RF Ref Osc on in Run/Wait</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>RF Ref Osc on in Stop</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>RF Ref Osc on in VLPR/VLPW</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>RF Ref Osc on in VLPS</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GASKET_BYPASS_OVRD_EN</name>
              <description>Gasket Bypass Override Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GASKET_BYPASS_OVRD</name>
              <description>Gasket Bypass Override</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_BYPASS_EN</name>
              <description>RF Ref Osc Bypass Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_ACTIVE_PORT_1_SEL</name>
              <description>BLE Active port 1 select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_ACTIVE_PORT_2_SEL</name>
              <description>BLE Active port 2 select</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_DEEP_SLEEP_EXIT</name>
              <description>BLE Deep Sleep Exit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_ACK_OVRD_EN</name>
              <description>Stop Acknowledge Override Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_ACK_OVRD</name>
              <description>Stop Acknowledge Override</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_READY</name>
              <description>RF Ref Osc Ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RF_OSC_READY_OVRD_EN</name>
              <description>RF Ref Osc Ready Override Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_READY_OVRD</name>
              <description>RF Ref Osc Ready Override</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCK_RADIO_RESETS</name>
              <description>Block Radio Resets</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCK_RADIO_OUTPUTS</name>
              <description>Block Radio Outputs</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_RESET</name>
              <description>Software Reset for the Radio</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE_DELAY</name>
          <description>RSIM BLE Active Delay</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_ACTIVE_FINE_DELAY</name>
              <description>The SoC Flash is presented with a BLE Active early warning signal to allow the Flash to complete any program or erase activities prior to a Radio communication event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_ACTIVE_COARSE_DELAY</name>
              <description>The SoC Flash is presented with a BLE Active early warning signal to allow the Flash to complete any program or erase activities prior to a Radio communication event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_MSB</name>
          <description>RSIM MAC MSB</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAC_ADDR_MSB</name>
              <description>MAC Address MSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_LSB</name>
          <description>RSIM MAC LSB</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAC_ADDR_LSB</name>
              <description>MAC Address LSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_TEST</name>
          <description>RSIM Analog Test</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ATST_GATE_EN</name>
              <description>ATST Transmission Gate Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_ID</name>
              <description>Radio Version ID number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Apache 1.0</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Apache 2.0</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>2.4 GHz Radio 2.0, Used by various SoC implementations</description>
                  <value>#0011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
