cmsis-svd/cmsis-svd/data/Freescale/MKW20Z4.svd
        <register>
          <name>TSM_OVRD0</name>
          <description>TSM Override 0</description>
          <addressOffset>0x2C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_REG_EN_OVRD_EN</name>
              <description>Override control for PLL_REG_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_REG_EN_OVRD to override the signal &quot;pll_reg_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_REG_EN_OVRD</name>
              <description>Override value for PLL_REG_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_REG_EN_OVRD_EN</name>
              <description>Override control for PLL_VCO_REG_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_VCO_REG_EN_OVRD to override the signal &quot;pll_vco_reg_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_REG_EN_OVRD</name>
              <description>Override value for PLL_VCO_REG_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QGEN_REG_EN_OVRD_EN</name>
              <description>Override control for QGEN_REG_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of QGEN_REG_EN_OVRD to override the signal &quot;qgen_reg_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QGEN_REG_EN_OVRD</name>
              <description>Override value for QGEN_REG_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_TX_REG_EN_OVRD_EN</name>
              <description>Override control for TCA_TX_REG_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TCA_TX_REG_EN_OVRD to override the signal &quot;tca_tx_reg_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCA_TX_REG_EN_OVRD</name>
              <description>Override value for TCA_TX_REG_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ANA_REG_EN_OVRD_EN</name>
              <description>Override control for ADC_ANA_REG_EN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of ADC_ANA_REG_EN_OVRD to override the signal &quot;adc_ana_reg_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_ANA_REG_EN_OVRD</name>
              <description>Override value for ADC_ANA_REG_EN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DIG_REG_EN_OVRD_EN</name>
              <description>Override control for ADC_DIG_REG_EN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of ADC_DIG_REG_EN_OVRD to override the signal &quot;adc_dig_reg_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DIG_REG_EN_OVRD</name>
              <description>Override value for ADC_DIG_REG_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_PLL_REF_CLK_EN_OVRD_EN</name>
              <description>Override control for XTAL_PLL_REF_CLK_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of XTAL_PLL_REF_CLK_EN_OVRD to override the signal &quot;xtal_pll_ref_clk_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_PLL_REF_CLK_EN_OVRD</name>
              <description>Override value for XTAL_PLL_REF_CLK_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_ADC_REF_CLK_EN_OVRD_EN</name>
              <description>Override control for XTAL_ADC_REF_CLK_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of XTAL_ADC_REF_CLK_EN_OVRD to override the signal &quot;xtal_adc_ref_clk_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_ADC_REF_CLK_EN_OVRD</name>
              <description>Override value for XTAL_ADC_REF_CLK_EN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_AUTOTUNE_EN_OVRD_EN</name>
              <description>Override control for PLL_VCO_AUTOTUNE_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_VCO_AUTOTUNE_EN_OVRD to override the signal &quot;pll_vco_autotune_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_AUTOTUNE_EN_OVRD</name>
              <description>Override value for PLL_VCO_AUTOTUNE_EN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_CYCLE_SLIP_LD_EN_OVRD_EN</name>
              <description>Override control for PLL_CYCLE_SLIP_LD_EN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_CYCLE_SLIP_LD_EN_OVRD to override the signal &quot;pll_cycle_slip_ld_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_CYCLE_SLIP_LD_EN_OVRD</name>
              <description>Override value for PLL_CYCLE_SLIP_LD_EN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_EN_OVRD_EN</name>
              <description>Override control for PLL_VCO_EN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_VCO_EN_OVRD to override the signal &quot;pll_vco_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_EN_OVRD</name>
              <description>Override value for PLL_VCO_EN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_BUF_RX_EN_OVRD_EN</name>
              <description>Override control for PLL_VCO_BUF_RX_EN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_VCO_BUF_RX_EN_OVRD to override the signal &quot;pll_vco_buf_rx_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_BUF_RX_EN_OVRD</name>
              <description>Override value for PLL_VCO_BUF_RX_EN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_BUF_TX_EN_OVRD_EN</name>
              <description>Override control for PLL_VCO_BUF_TX_EN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_VCO_BUF_TX_EN_OVRD to override the signal &quot;pll_vco_buf_tx_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_BUF_TX_EN_OVRD</name>
              <description>Override value for PLL_VCO_BUF_TX_EN</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_PA_BUF_EN_OVRD_EN</name>
              <description>Override control for PLL_PA_BUF_EN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_PA_BUF_EN_OVRD to override the signal &quot;pll_pa_buf_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PA_BUF_EN_OVRD</name>
              <description>Override value for PLL_PA_BUF_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LDV_EN_OVRD_EN</name>
              <description>Override control for PLL_LDV_EN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_LDV_EN_OVRD to override the signal &quot;pll_ldv_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_LDV_EN_OVRD</name>
              <description>Override value for PLL_LDV_EN</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_RX_LDV_RIPPLE_MUX_EN_OVRD_EN</name>
              <description>Override control for PLL_RX_LDV_RIPPLE_MUX_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_RX_LDV_RIPPLE_MUX_EN_OVRD to override the signal &quot;pll_rx_ldv_ripple_mux_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_RX_LDV_RIPPLE_MUX_EN_OVRD</name>
              <description>Override value for PLL_RX_LDV_RIPPLE_MUX_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
