cmsis-svd/cmsis-svd/data/Freescale/MKW20Z4.svd
        <register>
          <name>TSM_TIMING08</name>
          <description>TSM_TIMING08</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65336867</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_CYCLE_SLIP_LD_EN_TX_HI</name>
              <description>Assertion time setting for PLL_CYCLE_SLIP_LD_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_CYCLE_SLIP_LD_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_CYCLE_SLIP_LD_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_CYCLE_SLIP_LD_EN_RX_HI</name>
              <description>Assertion time setting for PLL_CYCLE_SLIP_LD_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_CYCLE_SLIP_LD_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_CYCLE_SLIP_LD_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING09</name>
          <description>TSM_TIMING09</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65056A05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_EN_TX_HI</name>
              <description>Assertion time setting for PLL_VCO_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_VCO_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_EN_RX_HI</name>
              <description>Assertion time setting for PLL_VCO_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_VCO_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING10</name>
          <description>TSM_TIMING10</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6509FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_BUF_RX_EN_RX_HI</name>
              <description>Assertion time setting for PLL_VCO_BUF_RX_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_BUF_RX_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_VCO_BUF_RX_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING11</name>
          <description>TSM_TIMING11</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A09</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_BUF_TX_EN_TX_HI</name>
              <description>Assertion time setting for PLL_VCO_BUF_TX_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_BUF_TX_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_VCO_BUF_TX_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING12</name>
          <description>TSM_TIMING12</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A64</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_PA_BUF_EN_TX_HI</name>
              <description>Assertion time setting for PLL_PA_BUF_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_PA_BUF_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_PA_BUF_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING13</name>
          <description>TSM_TIMING13</description>
          <addressOffset>0x31C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x651A6A4E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_LDV_EN_TX_HI</name>
              <description>Assertion time setting for PLL_LDV_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LDV_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_LDV_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LDV_EN_RX_HI</name>
              <description>Assertion time setting for PLL_LDV_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LDV_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_LDV_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING14</name>
          <description>TSM_TIMING14</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x650AFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_RX_LDV_RIPPLE_MUX_EN_RX_HI</name>
              <description>Assertion time setting for PLL_RX_LDV_RIPPLE_MUX_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_RX_LDV_RIPPLE_MUX_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_RX_LDV_RIPPLE_MUX_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING15</name>
          <description>TSM_TIMING15</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A0A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_TX_LDV_RIPPLE_MUX_EN_TX_HI</name>
              <description>Assertion time setting for PLL_TX_LDV_RIPPLE_MUX_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_TX_LDV_RIPPLE_MUX_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_TX_LDV_RIPPLE_MUX_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING16</name>
          <description>TSM_TIMING16</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A104E44</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_FILTER_CHARGE_EN_TX_HI</name>
              <description>Assertion time setting for PLL_FILTER_CHARGE_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_FILTER_CHARGE_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_FILTER_CHARGE_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_FILTER_CHARGE_EN_RX_HI</name>
              <description>Assertion time setting for PLL_FILTER_CHARGE_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_FILTER_CHARGE_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_FILTER_CHARGE_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING17</name>
          <description>TSM_TIMING17</description>
          <addressOffset>0x32C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65106A44</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_PHDET_EN_TX_HI</name>
              <description>Assertion time setting for PLL_PHDET_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_PHDET_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_PHDET_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_PHDET_EN_RX_HI</name>
              <description>Assertion time setting for PLL_PHDET_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_PHDET_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_PHDET_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING18</name>
          <description>TSM_TIMING18</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6505FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QGEN25_EN_RX_HI</name>
              <description>Assertion time setting for QGEN25_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QGEN25_EN_RX_LO</name>
              <description>Deassertion time setting for QGEN25_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING19</name>
          <description>TSM_TIMING19</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6864</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_EN_TX_HI</name>
              <description>Assertion time setting for TX_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_EN_TX_LO</name>
              <description>Deassertion time setting for TX_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING20</name>
          <description>TSM_TIMING20</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x651AFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_EN_RX_HI</name>
              <description>Assertion time setting for ADC_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_EN_RX_LO</name>
              <description>Deassertion time setting for ADC_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING21</name>
          <description>TSM_TIMING21</description>
          <addressOffset>0x33C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x651AFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_I_Q_EN_RX_HI</name>
              <description>Assertion time setting for ADC_I_Q_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_I_Q_EN_RX_LO</name>
              <description>Deassertion time setting for ADC_I_Q_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING22</name>
          <description>TSM_TIMING22</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x651AFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_DAC_EN_RX_HI</name>
              <description>Assertion time setting for ADC_DAC_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DAC_EN_RX_LO</name>
              <description>Deassertion time setting for ADC_DAC_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING23</name>
          <description>TSM_TIMING23</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x651AFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_RST_EN_RX_HI</name>
              <description>Assertion time setting for ADC_RST_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_RST_EN_RX_LO</name>
              <description>Deassertion time setting for ADC_RST_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING24</name>
          <description>TSM_TIMING24</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6518FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_EN_RX_HI</name>
              <description>Assertion time setting for BBF_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_EN_RX_LO</name>
              <description>Deassertion time setting for BBF_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING25</name>
          <description>TSM_TIMING25</description>
          <addressOffset>0x34C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6518FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCA_EN_RX_HI</name>
              <description>Assertion time setting for TCA_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_EN_RX_LO</name>
              <description>Deassertion time setting for TCA_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING26</name>
          <description>TSM_TIMING26</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65096A09</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_DIG_EN_TX_HI</name>
              <description>Assertion time setting for PLL_DIG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIG_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_DIG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIG_EN_RX_HI</name>
              <description>Assertion time setting for PLL_DIG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIG_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_DIG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING27</name>
          <description>TSM_TIMING27</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A67</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_DIG_EN_TX_HI</name>
              <description>Assertion time setting for TX_DIG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DIG_EN_TX_LO</name>
              <description>Deassertion time setting for TX_DIG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
