cmsis-svd/cmsis-svd/data/Freescale/MKW20Z4.svd
        <register>
          <name>CORR_CTRL</name>
          <description>CORR_CTRL</description>
          <addressOffset>0x3C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x482</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CORR_VT</name>
              <description>CORR_VT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORR_NVAL</name>
              <description>CORR_NVAL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_CORR_EN</name>
              <description>MAX_CORR_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MAX_CORR</name>
              <description>RX_MAX_CORR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MAX_PREAMBLE</name>
              <description>RX_MAX_PREAMBLE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_TYPE</name>
          <description>PN_TYPE</description>
          <addressOffset>0x3C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PN_TYPE</name>
              <description>PN_TYPE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_INV</name>
              <description>TX_INV</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_CODE</name>
          <description>PN_CODE</description>
          <addressOffset>0x3C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x744AC39B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PN_LSB</name>
              <description>PN_LSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PN_MSB</name>
              <description>PN_MSB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_CTRL</name>
          <description>Sync Control</description>
          <addressOffset>0x3CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNC_PER</name>
              <description>Symbol Sync Tracking Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACK_ENABLE</name>
              <description>TRACK_ENABLE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>symbol timing synchronization tracking disabled in Rx frontend</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>symbol timing synchronization tracking enabled in Rx frontend (default)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SNF_THR</name>
          <description>SNF_THR</description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SNF_THR</name>
              <description>SNIFF Mode Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAD_THR</name>
          <description>FAD_THR</description>
          <addressOffset>0x3D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x82</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAD_THR</name>
              <description>FAD_THR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZBDEM_AFC</name>
          <description>ZBDEM_AFC</description>
          <addressOffset>0x3D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFC_EN</name>
              <description>AFC_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCD_EN</name>
              <description>DCD Mode Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>NCD Mode (default)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DCD Mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFC_OUT</name>
              <description>AFC_OUT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPS_CTRL</name>
          <description>LPPS Control Register</description>
          <addressOffset>0x3DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPPS_ENABLE</name>
              <description>LPPS Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>LPPS mode disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>LPPS mode enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_QGEN25_ALLOW</name>
              <description>LPPS_QGEN25_ALLOW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disallow TSM output qgen25_en to be duty-cycled during LPPS</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Allow TSM output qgen25_en to be duty-cycled during LPPS</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_ADC_ALLOW</name>
              <description>LPPS_ADC_ALLOW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disallow ADC-related TSM outputs {adc_en, adc_bias_en} to be duty-cycled during LPPS.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Allow ADC-related TSM outputs {adc_en, adc_bias_en} to be duty-cycled during LPPS.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_ADC_CLK_ALLOW</name>
              <description>LPPS_ADC_CLK_ALLOW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disallow ADC-related TSM outputs {xtal_adc_ref_clk_en, adc_clk_en} to be duty-cycled during LPPS.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Allow ADC_CLK-related TSM outputs {xtal_adc_ref_clk_en, adc_clk_en} to be duty-cycled during LPPS.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_ADC_I_Q_ALLOW</name>
              <description>LPPS_ADC_I_Q_ALLOW</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disallow ADC_I/Q-related TSM outputs {adc_I_adc_en, adc_Q_adc_en} to be duty-cycled during LPPS.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Allow ADC_I/Q-related TSM outputs {adc_I_adc_en, adc_Q_adc_en} to be duty-cycled during LPPS.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_ADC_DAC_ALLOW</name>
              <description>LPPS_ADC_DAC_ALLOW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disallow ADC_DAC-related TSM outputs {adc_dac1_en, adc_dac2_en} to be duty-cycled during LPPS.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Allow ADC_DAC-related TSM outputs {adc_dac1_en, adc_dac2_en} to be duty-cycled during LPPS.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_BBF_ALLOW</name>
              <description>LPPS_BBF_ALLOW</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disallow BBF-related TSM outputs {bbf_i_en, bbf_q_en, bbf_pdet_en, bbf_dcoc_en} to be duty-cycled during LPPS.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Allow BBF-related TSM outputs {bbf_i_en, bbf_q_en, bbf_pdet_en, bbf_dcoc_en} to be duty-cycled during LPPS.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_TCA_ALLOW</name>
              <description>LPPS_TCA_ALLOW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disallow TCA-related TSM outputs {tca_en, tza_i_en, tza_q_en, tza_pdet_en, tza_dcoc_en} to be duty-cycled during LPPS.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Allow TCA-related TSM outputs {tca_en, tza_i_en, tza_q_en, tza_pdet_en, tza_dcoc_en} to be duty-cycled during LPPS.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CTRL</name>
          <description>ADC Control</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF0001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_32MHZ_SEL</name>
              <description>ADC 32MHZ Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_2X_CLK_SEL</name>
              <description>ADC_2X_CLK_SEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DITHER_ON</name>
              <description>ADC Dither On</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_TEST_ON</name>
              <description>ADC Test On</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_COMP_ON</name>
              <description>ADC Comparator Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_TUNE</name>
          <description>ADC Tuning</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x880033</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_R1_TUNE</name>
              <description>ADC_R1_TUNE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_R2_TUNE</name>
              <description>ADC_R2_TUNE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_C1_TUNE</name>
              <description>ADC_C1_TUNE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_C2_TUNE</name>
              <description>ADC_C2_TUNE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_ADJ</name>
          <description>ADC Adjustment</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x43033033</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_IB_OPAMP1_ADJ</name>
              <description>ADC_IB_OPAMP1_ADJ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IB_OPAMP2_ADJ</name>
              <description>ADC_IB_OPAMP2_ADJ</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IB_DAC1_ADJ</name>
              <description>ADC_IB_DAC1_ADJ</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IB_DAC2_ADJ</name>
              <description>ADC_IB_DAC2_ADJ</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IB_FLSH_ADJ</name>
              <description>ADC_IB_FLSH_ADJ</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_FLSH_RES_ADJ</name>
              <description>ADC_FLSH_RES_ADJ</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
