cmsis-svd/cmsis-svd/data/Freescale/MKW20Z4.svd
        <register>
          <name>ADC_REGS</name>
          <description>ADC Regulators</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_ANA_REG_SUPPLY</name>
              <description>ADC_ANA_REG_SUPPLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.2V</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.05V</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.075V</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.1V</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1.125V</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1.15V</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1.175V</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>1.2V</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>1.225V</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>1.25V</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>1.325V</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>1.35V</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>1.375V</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>1.4V</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_REG_DIG_SUPPLY</name>
              <description>ADC_REG_DIG_SUPPLY</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.2V</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.05V</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.075V</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.1V</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1.125V</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1.15V</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1.175V</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>1.2V</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>1.225V</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>1.25V</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>1.325V</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>1.35V</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>1.375V</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>1.4V</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_ANA_REG_BYPASS_ON</name>
              <description>ADC_ANA_REG_BYPASS_ON</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DIG_REG_BYPASS_ON</name>
              <description>ADC_DIG_REG_BYPASS_ON</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_VCMREF_BYPASS_ON</name>
              <description>ADC_VCMREF_BYPASS_ON</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_INTERNAL_IREF_BYPASS_ON</name>
              <description>ADC_INTERNAL_IREF_BYPASS_ON</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_TRIMS</name>
          <description>ADC Regulator Trims</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_IREF_OPAMPS_RES_TRIM</name>
              <description>ADC_IREF_OPAMPS_RES_TRIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IREF_FLSH_RES_TRIM</name>
              <description>ADC_IREF_FLSH_RES_TRIM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_VCM_TRIM</name>
              <description>ADC_VCM_TRIM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_TEST_CTRL</name>
          <description>ADC Test Control</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_ATST_SEL</name>
              <description>ADC Analog Test Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Inject 5uA refrence current on ATST0 ,Inject 0.6V reference voltage on ATST1</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Monitor Flash refrence currents on ATST3</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Monitor DAC refrence current on ATST0,Monitor mirrored reference current at ATST1,Monitor operational amplifiers reference current at ATST2, Monitor buffered 0.6V reference voltage used for opamp1 common mode at ATST3</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Monitored buffered 0.6V reference voltrage used for opamp2 common mode at ATST0 monitor buffered 0.6V reference voltage used for opam3 comon mode at ATST2. However opamp3 does not exisit in this silicon but there is still a buffered reference available.</description>
                  <value>#00011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DIG_REG_ATST_SEL</name>
              <description>ADC_DIG_REG_ATST_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ANA_REG_ATST_SEL</name>
              <description>ADC_ANA_REG_ATST_SEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_ALPHA_RADIUS_GS_IDX</name>
              <description>Alpha-R Scaling</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>1</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>1/2</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>1/4</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>1/8</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1/16</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1/32</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1/64</description>
                  <value>#110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SPARE3</name>
              <description>ADC_SPARE3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBF_CTRL</name>
          <description>Baseband Filter Control</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x173</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_CAP_TUNE</name>
              <description>BBF_CAP_TUNE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE2</name>
              <description>BBF_RES_TUNE2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_CUR_CNTL</name>
              <description>BBF_CUR_CNTL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Low current setting.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>High current setting.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBF_DCOC_ON</name>
              <description>BBF_DCOC_ON</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_TMUX_ON</name>
              <description>BBF_TMUX_ON</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_ALPHAC_SCALE_GS_IDX</name>
              <description>DCOC Alpha-C Scaling</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>1/2</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>1/4</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1/8</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1/16</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBF_SPARE_3_2</name>
              <description>BBF_SPARE_3_2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ANA_CTRL</name>
          <description>RX Analog Control</description>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_ATST_SEL</name>
              <description>RX_ATST_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IQMC_DC_GAIN_ADJ_EN</name>
              <description>IQMC_DC_GAIN_ADJ_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_SPARE_3_2_1</name>
              <description>LNM_SPARE_3_2_1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL_CTRL</name>
          <description>Crystal Oscillator Control Register 1</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xACAC177</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_TRIM</name>
              <description>XTAL Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_GM</name>
              <description>XTAL_GM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_BYPASS</name>
              <description>XTAL Bypass</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_READY_COUNT_SEL</name>
              <description>XTAL Ready Count Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>1024 clock cycles</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>2048 clock cycles</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>4096 clock cycles</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>8192 clock cycles</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_COMP_BIAS_LO</name>
              <description>XTAL_COMP_BIAS (Low)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_ALC_START_512U</name>
              <description>XTAL_ALC_START_512U</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Start XTAL ALC at 256usec</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Start XTAL ALC at 512usec</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_ALC_ON</name>
              <description>XTAL_ALC_ON</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_COMP_BIAS_HI</name>
              <description>XTAL_COMP_BIAS (High)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_READY</name>
              <description>XTAL Ready Indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
